Revit 2024 API
ConduitSize Members
The ConduitSize type exposes the following members.
Constructors
Name | Description
ConduitSize
 Constructs an object that stores the basic size information for conduit.
Methods
Name | Description
Dispose
Releases all resources used by the ConduitSize
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BendRadius
 Minimum bend radius
InnerDiameter
 Inner diameter
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NominalDiameter
 Nominal diameter
OuterDiameter
 Outer diameter
UsedInSizeLists
 Whether it is used in size lists.
UsedInSizing
 Whether is used in sizing.
See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace